import requests
import parsel
import time
import re


url = "http://agency.695716.com/index.php?act=income"
guanggao = """['(0)全部', '(640375)至尊蓝月', '(640376)至尊蓝月-2', '(640377)贪玩蓝月', '(640378)贪玩蓝月-2',
    '(640389)蓝月至尊版', '(640390)蓝月至尊版-2', '(640391)蓝月争霸', '(640392)蓝月争霸-2', '(655592)至尊蓝月', '(655593)至尊蓝月-2', 
     '(655594)达叔传奇', '(655595)达叔传奇-2', '(667006)达叔传奇-3', '(667007)达叔传奇-4', '(667008)达叔传奇-5', '(667009)达叔传奇-6', '(667010)达叔传奇-7', 
     '(667011)至尊蓝月-3', '(667012)至尊蓝月-4', '(667013)至尊蓝月-5', '(667014)至尊蓝月-6', '(667015)至尊蓝月-7', 
     '(667016)蓝月争霸-3', '(667017)蓝月争霸-4', '(667018)蓝月争霸-5', '(667019)蓝月争霸-6', '(667020)蓝月争霸-7', '(667031)蓝月至尊版', '(667032)蓝月至尊版-2', '(667033)蓝月至尊版-3', '(667034)蓝月至尊版-4', '(667035)蓝月至尊版-5', '(667036)蓝月至尊版-6', '(667037)蓝月至尊版-7', 
     '(675035)蓝月王者', '(675036)蓝月王者-2', '(675037)蓝月王者-3', '(675038)蓝月王者-4', '(675039)蓝月王者-5', 
     '(675040)蓝月高爆版', '(675041)蓝月高爆版-2', '(675042)蓝月高爆版-3', '(675043)蓝月高爆版-4', '(675044)蓝月高爆版-5', 
     '(704502)散人传奇', '(704503)散人传奇-2', '(704504)散人传奇-3', '(704505)散人传奇-4', '(704506)散人传奇-5', 
     '(704507)雷霆主宰', '(704508)雷霆主宰-2', '(704509)雷霆主宰-3', '(704510)雷霆主宰-4', '(704511)雷霆主宰-5', 
     '(704512)天王传奇', '(704513)天王传奇-2', '(704514)天王传奇-3', '(704515)天王传奇-4', '(704516)天王传奇-5', 
    '(704517)蓝月社会版', '(704518)蓝月社会版-2', '(704519)蓝月社会版-3', '(704520)蓝月社会版-4', '(704521)蓝月社会版-5', 
    '(736705)736705-凡人修仙记-不朽凡人(安卓)-凡人修仙记-1', '(736706)736706-凡人修仙记-不朽凡人(安卓)-凡人修仙记-2', '(736707)736707-凡人修仙记-不朽凡人(安卓)-凡人修仙记-3', '(736708)736708-凡人修仙记-不朽凡人(安卓)-凡人修仙记-4', '(736709)736709-凡人修仙记-不朽凡人(安卓)-凡人修仙记-5', 
    '(739082)达叔传奇-9', '(739083)达叔传奇-10', '(739084)达叔传奇-11', '(739085)达叔传奇-12', '(739086)达叔传奇-13', '(739087)达叔传奇-14', '(739088)达叔传奇-15', '(739089)达叔传奇-16', '(739090)达叔传奇-17', '(739091)达叔传奇-18', 
    '(739093)739093-【H5】超变蓝月-短信专用-555(安卓)-超变蓝月-1', '(739094)739094-【H5】超变蓝月-短信专用-555(安卓)-超变蓝月-2', '(739095)739095-【H5】超变蓝月-短信专用-555(安卓)-超变蓝月-3', '(739096)739096-【H5】超变蓝月-短信专用-555(安卓)-超变蓝月-4', '(739097)739097-【H5】超变蓝月-短信专用-555(安卓)-超变蓝月-5', '(739098)739098-【H5】超变蓝月-短信专用-555(安卓)-超变蓝月-6', '(739099)739099-【H5】超变蓝月-短信专用-555(安卓)-超变蓝月-7', '(739100)739100-【H5】超变蓝月-短信专用-555(安卓)-超变蓝月-8', '(739101)739101-【H5】超变蓝月-短信专用-555(安卓)-超变蓝月-9', '(739102)739102-【H5】超变蓝月-短信专用-555(安卓)-超变蓝月-10', 
    '(739103)739103-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-1', '(739104)739104-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-2', '(739105)739105-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-3', '(739106)739106-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-4', '(739107)739107-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-5', '(739108)739108-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-6', '(739109)739109-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-7', '(739110)739110-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-8', '(739111)739111-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-9', '(739112)739112-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-10',
    '(739113)739113-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-1', '(739114)739114-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-2', '(739115)739115-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-3', '(739116)739116-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-4', '(739117)739117-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-5', '(739118)739118-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-6', '(739119)739119-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-7', '(739120)739120-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-8', '(739121)739121-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-9', '(739122)739122-【H5】蓝月超变-短信专用-555(安卓)-蓝月超变-10', 
    '(739123)739123-【H5】BT蓝月高爆版-短信专用-555(安卓)-BT蓝月高爆版-1', '(739124)739124-【H5】BT蓝月高爆版-短信专用-555(安卓)-BT蓝月高爆版-2', '(739125)739125-【H5】BT蓝月高爆版-短信专用-555(安卓)-BT蓝月高爆版-3', '(739126)739126-【H5】BT蓝月高爆版-短信专用-555(安卓)-BT蓝月高爆版-4', '(739127)739127-【H5】BT蓝月高爆版-短信专用-555(安卓)-BT蓝月高爆版-5', '(739128)739128-【H5】BT蓝月高爆版-短信专用-555(安卓)-BT蓝月高爆版-6', '(739129)739129-【H5】BT蓝月高爆版-短信专用-555(安卓)-BT蓝月高爆版-7', '(739130)739130-【H5】BT蓝月高爆版-短信专用-555(安卓)-BT蓝月高爆版-8', '(739131)739131-【H5】BT蓝月高爆版-短信专用-555(安卓)-BT蓝月高爆版-9', '(739132)739132-【H5】BT蓝月高爆版-短信专用-555(安卓)-BT蓝月高爆版-10', 
    '(741670)741670-【H5】蓝月私服-短信专用-555(安卓)-蓝月私服-1', '(741671)741671-【H5】蓝月私服-短信专用-555(安卓)-蓝月私服-2', '(741672)741672-【H5】蓝月私服-短信专用-555(安卓)-蓝月私服-3', '(741673)741673-【H5】蓝月私服-短信专用-555(安卓)-蓝月私服-4', '(741674)741674-【H5】蓝月私服-短信专用-555(安卓)-蓝月私服-5', '(741675)741675-【H5】蓝月私服-短信专用-555(安卓)-蓝月私服-6', '(741676)741676-【H5】蓝月私服-短信专用-555(安卓)-蓝月私服-7', '(741677)741677-【H5】蓝月私服-短信专用-555(安卓)-蓝月私服-8', '(741678)741678-【H5】蓝月私服-短信专用-555(安卓)-蓝月私服-9', '(741679)741679-【H5】蓝月私服-短信专用-555(安卓)-蓝月私服-10', 
    '(745100)745100-【H5】达叔传奇-短信专用-555(安卓)-达叔传奇-19-1', '(745102)745102-【H5】达叔传奇-短信专用-555(安卓)-达叔传奇-19-2', '(745104)745104-【H5】达叔传奇-短信专用-555(安卓)-达叔传奇-19-3', '(745106)745106-【H5】达叔传奇-短信专用-555(安卓)-达叔传奇-19-4', '(745108)745108-【H5】达叔传奇-短信专用-555(安卓)-达叔传奇-19-5', '(745110)745110-【H5】达叔传奇-短信专用-555(安卓)-达叔传奇-19-6', '(745112)745112-【H5】达叔传奇-短信专用-555(安卓)-达叔传奇-19-7', '(745113)745113-【H5】达叔传奇-短信专用-555(安卓)-达叔传奇-19-8', '(745114)745114-【H5】达叔传奇-短信专用-555(安卓)-达叔传奇-19-9', '(745115)745115-【H5】达叔传奇-短信专用-555(安卓)-达叔传奇-19-10'
    ]"""
print(guanggao)
print("时间格式2020-06-18")
ids = ['0', '', '640375', '640376', '640377', '640378', '640389', '640390', '640391', '640392', '655592', '655593', '655594', '655595', '667006', '667007', '667008', '667009', '667010', '667011', '667012', '667013', '667014', '667015', '667016', '667017', '667018', '667019', '667020', '667031', '667032', '667033', '667034', '667035', '667036', '667037', '675035', '675036', '675037', '675038', '675039', '675040', '675041', '675042', '675043', '675044', '704502', '704503', '704504', '704505', '704506', '704507', '704508', '704509', '704510', '704511', '704512', '704513', '704514', '704515', '704516', '704517', '704518', '704519', '704520', '704521', '736705', '736706', '736707', '736708', '736709', '739082', '739083', '739084', '739085', '739086', '739087', '739088', '739089', '739090', '739091', '739093', '739094', '739095', '739096', '739097', '739098', '739099', '739100', '739101', '739102', '739103', '739104', '739105', '739106', '739107', '739108', '739109', '739110', '739111', '739112', '739113', '739114', '739115', '739116', '739117', '739118', '739119', '739120', '739121', '739122', '739123', '739124', '739125', '739126', '739127', '739128', '739129', '739130', '739131', '739132', '741670', '741671', '741672', '741673', '741674', '741675', '741676', '741677', '741678', '741679', '745100', '745102', '745104', '745106', '745108', '745110', '745112', '745113', '745114', '745115']
# print(ids)
while True:
    # 不做选择，则为默认值
    site_id = input("广告位：")
    if site_id in ids:
        site_id = site_id
    else:
        # 输入的广告位不存在，则全部打印
        print("广告位不存在打印全部")
        site_id = ""

    d1 = input("起始时间：")
    if d1:
        d1 = d1
    else:
        d1 = "2020-06-11"

    # 获取当前日期，并进行格式化
    endtime= time.strftime("%Y-%m-%d", time.localtime(time.time()))
    d2 = input("结束时间：")
    if d2:
        d2 = d2
    else:
        d2 = endtime


    data = {
        'site_id': site_id,
        'd1': d1,
        'd2': d2,
        'button': '查看',
        }

    headers = {
        'Accept': 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9',
        'Accept-Encoding': 'gzip, deflate',
        'Accept-Language': 'zh-CN,zh;q=0.9',
        'Cache-Control': 'no-cache',
        'Connection': 'keep-alive',
        'Content-Length': '68',
        'Content-Type': 'application/x-www-form-urlencoded',
        'Cookie': 'PHPSESSID=cnrue40i9ntgl5i5kv080j51v3',
        'Host': 'agency.695716.com',
        'Origin': 'http://agency.695716.com',
        'Pragma': 'no-cache',
        'Referer': 'http://agency.695716.com/index.php?act=income',
        'Upgrade-Insecure-Requests': '1',
        'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.97 Safari/537.36',

    }



    response =requests.post(url=url, headers=headers, data=data)
    # print(response.text)

    selector = parsel.Selector(response.text)
    # adslot = selector.css("#site_id ::text").getall()
    # print("广告位")
    # print(adslot)
    # ids = selector.css("#site_id ::attr(value)").getall()
    # print("游戏id")
    # print(ids)
    ggw = str(re.findall("\("+site_id+".*?\'", guanggao))
    print("广告位"+ggw)
    print("起始时间"+d1)

    print("结束时间"+d2)
    starttime = selector.css(".tabB td:first-child::text").getall()
    number = selector.css(".tabB td:nth-child(2)::text").getall()
    print(starttime)
    # print(number)
    print("*"*50)
    for t, t1 in zip(starttime, number):
        print("时间"+t, "注册数"+t1)

        with open("C:\\Users\\EDZ\\Desktop\\cs.csv", "a", encoding="utf-8") as f:
            text = f'{t}, {t1}, {ggw}'
            f.write(text)
            f.write('\n')